---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.IsProductList
source: html/2562235d-fa53-7829-8a09-de04c42ccc84.htm
---
# Autodesk.Revit.DB.FabricationPart.IsProductList Method

Gets whether or not the fabrication part is a product list.

## Syntax (C#)
```csharp
public bool IsProductList()
```

## Returns
Returns true if the fabrication part is a product list.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - the fabrication part is not a product list.